na423-final-project-resources/run-grid-coarse-KVLCC2-SA/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p;
}
dimensions [ 0 2 -2 0 0 0 0 ];
internalField uniform 0.0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    side 
    {
        type            zeroGradient;
    }
    sym
    {
        type            symmetryPlane;
    }
    bot
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    hull
    {
        type            zeroGradient;
    }

}
